// Завдання 1

// Реалізуй клас, що описує коло. У класі повинні бути такі компоненти:

// поле, що зберігає радіус кола;
// get-властивість, яке повертає радіус кола;
// set-властивість, що встановлює радіус кола;
// get-властивість, яке повертає діаметр кола;
// метод, що обчислює площу кола;
// метод, що обчислює довжину кола.
// Продемонструй роботу властивостей і методів.

class Circle {
    constructor(radius) {
        this.radius = radius;
    }
    
    get radius() {
        return this._radius;
    }
    
    set radius(value) {
        this._radius = value;
    }
    // обчислення діаметра
    get diameter() {
        return this._radius * 2;
    }
    // обчислення площі
    area() {
        return(Math.PI * this._radius ** 2).toFixed(2);
    }
    //обчислення довжини кола
    length() {
        return(2 * Math.PI * this._radius).toFixed(2);
    }
}

const circle = new Circle('25');
console.log(circle.radius);

console.log('Діаметр = ' + circle.diameter);
console.log('Площа = '+ circle.area());
console.log('Довжина = '+ circle.length());


// Завдання 2

// Реалізуй клас, що описує канцелярський маркер. У класі повинні бути такі компоненти:

// поле, яке зберігає колір маркера;
// поле, яке зберігає кількість чорнил у маркері (у відсотках);
// метод для вводу (приймає рядок і виводить текст відповідним кольором; текст виводиться до тих пір, поки в маркері є чорнило; один не пробільний символ — це 0,5% чорнил у маркері).
// Реалізуй клас, що описує маркер, який можна перезаправляти. Успадкуй цей клас від простого маркера і додай метод для заправки.

// Продемонструй роботу написаних методів.

class Marker {
    constructor(color, inkPercent) {
        this.color = color;
        this.inkPercent = inkPercent;
    }
}

